"""Точка входа в приложение"""
# из файла build.py используем функцию setupGame()
from build import setupGame
# из файла structs.py подключаем класс Gamer
from structs import Gamer

def main():
    """Главная функция программы"""

    # создаём список экземпляров класса Chattel всех полей игрового поля
    cards = setupGame()

    # создаём игрока
    pl = Gamer("Vas",1000,0)
    # отображаем общие сведения об игроке
    pl.status() 
    # выводим название улицы, на которой стоит игрок pl
    print(cards[pl.get_index()].get_title()) 

    #Тест движения фишки по полю и увеличение денег при проходе круга
    while pl.money < 1600: # двигаемся пока у игрока не будет 1600$
        # ход игрока
        pl.go()
    else:
        print("Цель в 1600$ достигнута!")
        # Отображаем общие сведения об игроке
        pl.status()

# Выполни содержимое if при запуске исходного файла main.py в качестве основного, а не при вызове из другого файла
if __name__ == "__main__":
    # Вызов главной функции
    main()